[
  {
    "id": "bd4c5e09-d971-4bf9-93c3-923517262ac5",
    "answer": "233168",
    "difficulty": "easy",
    "questionHtml": "<div><p>If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.</p> <p>Find the sum of all the multiples of 3 or 5 below 1000.</p></div>"
  },
  {
    "id": "dae932c5-a500-4a6e-87ae-e5a59dd303d3",
    "answer": "4613732",
    "difficulty": "easy",
    "questionHtml": "<div><p>Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:</p><p style=\"text-align: center;\">1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...</p><p>By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.</p></div>"
  },
  {
    "id": "e8ce9fa6-fb7d-458f-b6ad-7d2058357dc3",
    "answer": "6857",
    "difficulty": "easy",
    "questionHtml": "<div><p>The prime factors of 13195 are 5, 7, 13 and 29.</p><p>What is the largest prime factor of the number 600851475143 ?</p></div>"
  },
  {
    "id": "6a27b8d1-533e-4f16-bdcd-77574c658f56",
    "answer": "121313",
    "difficulty": "medium",
    "questionHtml": "<div><p>By replacing the 1<sup>st</sup> digit of the 2-digit number *3, it turns out that six of the nine possible values: 13, 23, 43, 53, 73, and 83, are all prime.</p><p>By replacing the 3<sup>rd</sup> and 4<sup>th</sup> digits of 56**3 with the same digit, this 5-digit number is the first example having seven primes among the ten generated numbers, yielding the family: 56003, 56113, 56333, 56443, 56663, 56773, and 56993. Consequently 56003, being the first member of this family, is the smallest prime with this property.</p><p>Find the smallest prime which, by replacing part of the number (not necessarily adjacent digits) with the same digit, is part of an eight prime value family.</p></div>"
  },
  {
    "id": "1bf29df5-0742-4ba3-be51-8e6222c6b690",
    "answer": "127035954683",
    "difficulty": "medium",
    "questionHtml": "<div><p>The cube, 41063625 (345<sup>3</sup>), can be permuted to produce two other cubes: 56623104 (384<sup>3</sup>) and 66430125 (405<sup>3</sup>). In fact, 41063625 is the smallest cube which has exactly three permutations of its digits which are also cube.</p><p>Find the smallest cube for which exactly five permutations of its digits are cube.</p></div>"
  },
  {
    "id": "0cec3e39-54ff-4702-b8c1-dcc2914446f4",
    "answer": "1587000",
    "difficulty": "medium",
    "questionHtml": "<div><p>Working from left-to-right if no digit is exceeded by the digit to its left it is called an increasing number; for example, 134468.</p><p>Similarly if no digit is exceeded by the digit to its right it is called a decreasing number; for example, 66420.</p><p>We shall call a positive integer that is neither increasing nor decreasing a \"bouncy\" number; for example, 155349.</p><p>Clearly there cannot be any bouncy numbers below one-hundred, but just over half of the numbers below one-thousand (525) are bouncy. In fact, the least number for which the proportion of bouncy numbers first reaches 50% is 538.</p><p>Surprisingly, bouncy numbers become more and more common and by the time we reach 21780 the proportion of bouncy numbers is equal to 90%.</p><p>Find the least number for which the proportion of bouncy numbers is exactly 99%.</p></div>"
  },
  {
    "id": "92764974-e51a-4719-bf4a-2a4486dfc52e",
    "answer": "2906969179",
    "difficulty": "hard",
    "questionHtml": "<div><p>The palindromic number 595 is interesting because it can be written as the sum of consecutive squares: 6<sup>2</sup> + 7<sup>2</sup> + 8<sup>2</sup> + 9<sup>2</sup> + 10<sup>2</sup> + 11<sup>2</sup> + 12<sup>2</sup>.</p><p>There are exactly eleven palindromes below one-thousand that can be written as consecutive square sums, and the sum of these palindromes is 4164. Note that 1 = 0<sup>2</sup> + 1<sup>2</sup> has not been included as this problem is concerned with the squares of positive integers.</p><p>Find the sum of all the numbers less than 10<sup>8</sup> that are both palindromic and can be written as the sum of consecutive squares.</p></div>"
  },
  {
    "id": "bd866ed6-ff3a-4b96-b61a-e6aa2b6315d5",
    "answer": "2269",
    "difficulty": "hard",
    "questionHtml": "<div><p>A bag contains one red disc and one blue disc. In a game of chance a player takes a disc at random and its colour is noted. After each turn the disc is returned to the bag, an extra red disc is added, and another disc is taken at random.</p><p>The player pays £1 to play and wins if they have taken more blue discs than red discs at the end of the game.</p><p>If the game is played for four turns, the probability of a player winning is exactly 11/120, and so the maximum prize fund the banker should allocate for winning in this game would be £10 before they would expect to incur a loss. Note that any payout will be a whole number of pounds and also includes the original £1 paid to play the game, so in the example given the player actually wins £9.</p><p>Find the maximum prize fund that should be allocated to a single game in which fifteen turns are played.</p></div>"
  },
  {
    "id": "ca28cabc-20b3-4940-ad63-366855446673",
    "answer": "608720",
    "difficulty": "hard",
    "questionHtml": "<div><p>Some positive integers <i>n</i> have the property that the sum [ <i>n</i> + reverse(<i>n</i>) ] consists entirely of odd (decimal) digits. For instance, 36 + 63 = 99 and 409 + 904 = 1313. We will call such numbers <em>reversible</em>; so 36, 63, 409, and 904 are reversible. Leading zeroes are not allowed in either <i>n</i> or reverse(<i>n</i>).</p><p>There are 120 reversible numbers below one-thousand.</p><p>How many reversible numbers are there below one-billion (10<sup>9</sup>)?</p></div>"
  }
]
